Конфигурация/src/Catalogs/Ленты/Ленты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ленты</name>
  <attributes>
    <name>ОсновнойТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ЛентыФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <comment>width</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <comment>height</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/Catalogs/Ленты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	НоваяСтрока = Объект.Комментарии.Добавить();
	НоваяСтрока.Коментарий = ВыбранноеЗначение.ВведенныйТекст;
	
	КоличествоСтрок = Объект.Комментарии.Количество();
	Объект.Комментарии.Сдвинуть(КоличествоСтрок - 1, -1);	
КонецПроцедуры

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 	Если Объект.Комментарии.Количество() = 0 Тогда
 		ДобавитьНачальнуюСтраницуHTML();	
 	КонецЕсли;	
 	
 	СформироватьОсновнойТекст()
 КонецПроцедуры
 
#КонецОбласти
 
 #Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаВвестиТекст(Команда)
	ОткрытьФорму("Справочник.Ленты.Форма.ФормаВводаТекста",,ЭтотОбъект);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 &НаСервере
 Процедура СформироватьОсновнойТекст()
 	Объект.ОсновнойТекст = "";
 	Для Каждого СтрокаТЧ Из Объект.Комментарии Цикл
 		Объект.ОсновнойТекст = Объект.ОсновнойТекст + СтрокаТЧ.Коментарий;
 	КонецЦикла;	
 КонецПроцедуры

 &НаСервере
 Процедура ДобавитьНачальнуюСтраницуHTML()
 	ДобавитьНачалоHTML();	
 	ДобавитьКонецHTML();
 КонецПроцедуры

 &НаСервере
 Процедура ДобавитьКонецHTML()
 	НоваяСтрока = Объект.Комментарии.Добавить();
 	
 	ТекстКоментария =	"	</body>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "</html>";
 	 
 	НоваяСтрока.Коментарий = ТекстКоментария;
 КонецПроцедуры

 &НаСервере
 Процедура ДобавитьНачалоHTML()
 	НоваяСтрока = Объект.Комментарии.Добавить();
 	
 	ТекстКоментария = "<!DOCTYPE html>"; 
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "<html lang=""ru>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<head>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "		<meta charset=""UTF-8>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "		 <title>" + Объект.Наименование + "</title>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	</head>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<body>";
 	
 	НоваяСтрока.Коментарий = ТекстКоментария; 
 КонецПроцедуры
 
#КонецОбласти
